app/controllers/courts_controller.rb

  def index
    @courts = Court.all
---
SELECT "courts".* FROM "courts"

	def add_reservation
      @reservation = Reservation.find(parsms[:start_time])
---
SELECT "reservations".* FROM "reservations" WHERE "reservations"."court_id" = $1  [["court_id", 1]]

    def set_court
      @court = Court.find(params[:id])
---
SELECT "courts".* FROM "courts" WHERE "courts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]