app/controllers/reservations_controller.rb

SELECT "courts".* FROM "courts" WHERE "courts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "reservations" ("user_id", "court_id", "created_at", "updated_at", "name", "start_time", "end_time") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    court = Court.find(params[:court_id])
    reservation = Reservation.new(reservation_params)
    reservation.court = court
    reservation.user = @current_user
    if reservation.save!

SELECT "reservations".* FROM "reservations" WHERE "reservations"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "reservations" SET "name" = $1, "updated_at" = $2 WHERE "reservations"."id" = $3  [["name", "Timmy"], ["updated_at", "2020-04-13 22:46:42.674162"], ["id", 1]]
---
  def update
    reservation = Reservation.find(params[:id])
    reservation.update(reservation_params)

SELECT "reservations".* FROM "reservations" WHERE "reservations"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "reservations" WHERE "reservations"."id" = $1  [["id", 3]]
---
  def destroy
    reservation = Reservation.find(params[:id])
    reservation.destroy